import ArticleCard from '@/components/ArticleCard';
import React from 'react';
import styles from '@/styles/article-card.module.scss';

export function RelatedArticlesMajor() {
  return (
    <div className="column max-width--page layout-stack" style={{ paddingBottom: 'var(--padding--xl)' }}>
      <h2>
        مقاله‌های انتخاب رشته
      </h2>
      <div className="card-grid gap--l">
        <ArticleCard
          className={styles.relatedArticleCard}
          slug="/choose-major"
          link="/choose-major"
          excerpt="راهنمایی گام‌به‌گام برای انتخاب رشتهٔ هوشمندانه براساس تحقیقات علمی در جهان و تحقیقات میدانی ۱۰۰۰۰روز جواب کوتاه (چکیدهٔ ۵ دقیقه‌ای): به‌طور خلاصه، یکی از چهار حالت زیر ممکن است برای شما پیش‌ بیاید، که هر کدام نیازمند استراتژی ویژهٔ خود است: یک) درست نمی‌دانید به چه چیزی علاقه دارید. اگر جزو این دسته هستید، از انتخاب‌های پرریسک و بازار کار کوچک پرهیز کنید. بیشتر افراد در سن ورود به دانشگاه در این دسته قرار دارند، که این مسئله اصلاً دور از انتظار نیست؛ چراکه در این سن و با فضای کمی که سیستم آموزشی در اختیار افراد قرار می‌دهد، فرصت
                  "
          title="چجوری انتخاب رشته کنم که پشیمون نشم؟"
        />
        <ArticleCard
          className={styles.relatedArticleCard}
          slug="/surveys/major"
          link="/surveys/major"
          excerpt="انتخاب رشته یکی از مهم‌ترین مراحل زندگی ما به حساب می‌آید و بسیار مهم است که با اطلاعات کافی به سراغ آن برویم. این گزارش، ماحصل تجربیات ۲۲۶۹ نفر پاسخ‌دهنده است و مطالعهٔ آن می‌تواند دید بسیار خوبی نسبت به موضوع انتخاب رشته بدهد."
          title="نگاهی داده‌محور به مسئلهٔ انتخاب رشته"
        />
        <ArticleCard
          className={styles.relatedArticleCard}
          link="/posts/get-help-with-choosing-major"
          excerpt=" بسیاری از تجربیات ما از تلاش کردن، شکست خوردن و دوباره تلاش کردن به دست می‌آید؛ اما بعضی اوقات، گزینه‌هایی هستند که ارزش آزمون و خطا را ندارند، یا آزمودن آن‌ها به‌قدری زمان، انرژی و هزینه‌بر است که در صورت شکست، خسارت زیادی به ما وارد می‌کند و جبرانشان بسیار دشوار می‌شود. انتخاب رشتهٔ تحصیلی، یک نمونه از این مواقع است. اگرچه هیچ‌وقت برای جبران و اصلاح هیچ مسیری دیر نیست، اما انتخاب رشتهٔ اشتباه، می‌تواند چندین سال از زندگی ما را به خود اختصاص دهد و انرژی، زمان و هزینه‌ای "
          title="چگونه برای انتخاب رشته از دیگران اطلاعات بگیریم؟"
        />
        <ArticleCard
          className={styles.relatedArticleCard}
          link="/posts/admission-mechanism"
          excerpt="   نتیجه انتخاب رشته، به جز رتبه شما در کنکور، به عوامل دیگری نیز بستگی دارد. عواملی که اگر آن‌ها را بشناسید، می‌تواند کمک کند انتخاب رشته بهتری انجام دهید. در این مقاله، سازکار انتخاب رشته و مهم‌ترین عوامل تاثیرگذار روی نتیجه انتخاب رشته را توضیح می‌دهیم. سازوکار پذیرفتن دانشجو در دانشگاه به چه شکل است؟ پیش از بررسی عوامل تاثیرگذار روی قبول شدن داوطلب، بهتر است نگاهی به سازوکار پذیرش داوطلب بیندازیم.&nbsp; در بازه زمانی‌ای که سازمان سنجش برای انتخاب رشته مشخص میکند، داوطلبان فرصت دارند تا در یک لیست حداکثر
                  "
          title="سازوکار بررسی انتخاب رشتهٔ شما و عوامل مؤثر در نتیجهٔ آن"
        />
        <ArticleCard
          className={styles.relatedArticleCard}
          link="/posts/research-majors"
          excerpt=" انتخاب رشته، از انتخاب‌های مهمی است که می‌تواند تاثیر بسیاری بر زندگی فرد بگذارد. انتخابی که مانند همه تصمیم‌گیری‌های زندگی، ممکن است با اشتباهاتی همراه شود و باید ابعاد بسیاری را در مورد آن مورد توجه قرار داد. یکی از این ابعاد، داشتن شناختی جامع و مناسب از رشته دانشگاهی مورد نظرتان و شرایط آن است. در این مقاله، به بررسی نکاتی پرداخته‌ایم که بهتر است در هنگام بررسی یک رشته دانشگاهی، به آن‌ها توجه کنید. آینده آن رشته در بازار کار احتمالا یکی از اهداف اصلی شما برای تحصیل در
"
          title="چگونه یک رشته را بهتر بشناسیم؟"
        />
        <ArticleCard
          className={styles.relatedArticleCard}
          link="/posts/comparing-universities"
          excerpt=" انتخاب رشته، یکی از تصمیمات تاثیرگذار زندگی هر فرد است. در این مرحله از مسیر تحصیلی، یکی از مسائلی که می‌تواند تاثیر زیادی روی نتیجه نهایی داشته باشد، دانشگاهی است که انتخاب می‌شود. با مطالعه این یادداشت، با ۶ نوع دانشگاه های ایران آشنا می‌شوید؛ ابتدا اعتبار مدرک و آموزش ارائه شده در هریک مورد بررسی قرار میگیرد و اینکه دریافت پذیرش از آنها چقدر دشوار است. سپس هر یک از دانشگاهها به طور مجزا زیر ذره بین می روند؛ اینکه هر کدام تحت نظارت چه مرکزی هستند، چه مزایا و"
          title="مقایسهٔ انواع دانشگاه‌‌های ایران و نکاتی که بهتر است دربارهٔ هرکدام بدانید"
        />
      </div>
    </div>
  );
}
