import React from 'react';
import VerticalBarChart from '@/components/graphs/VerticalBarChart';
import BarChart, { chartColors } from '@/components/graphs/BarChart';
import percentageData, { percentageDataForBarCharts } from '@/utils/percentageData';
import * as data from '@/data/choosingMajorData';

const ReportWebVersion = () => {
  return (
    <div className="fa-num layout-stack-all a-start">
      <Description title="دربارهٔ گزارش">
        بعد از انتشار نظرسنجی بررسی تجربهٔ افراد در انتخاب رشته در سال ۱۴۰۰، با تحلیل داده‌ها به نتایجی دست یافتیم که برایمان قابل‌تأمل بود؛ نتایجی که باور داشتیم می‌تواند دیدمان را نسبت به انتخاب رشته و میزان اهمیت آن تغییر دهد؛ این شد که تصمیم گرفتیم بار دیگر، با سؤالات دقیق‌تر و جامعهٔ آماری گسترده‌تر، گام دیگری در راستای بهبود این تجربه برداریم.
        این گزارش می‌تواند نقشهٔ راهی باشد برای آنهایی که هنوز انتخاب رشته نکرده‌اند و نمی‌دانند چگونه باید این مرحله را پشت‌سر بگذارند، و آینه‌ای تمام‌نما باشد برای کسانی که از این گذرگاه عبور کرده‌اند و قصد دارند نگاهی به گذشتهٔ خود بیندازند و تجربیات خود را این بار، با دیدی متفاوت مرور کنند.
      </Description>
      <Description title="پاسخ‌دهندگان">
        درمجموع ۳۱۰۸ نفر این نظرسنجی را تکمیل کردند. ازآنجاکه نظرسنجی دربارهٔ تجربهٔ زیستهٔ انتخاب رشته بود، پاسخ‌های افراد با تحصیلات دیپلم و زیردیپلم را حذف کردیم.
        همچنین با کمک پرسش‌های راستی‌سنج و بررسی پاسخ‌به‌پاسخ، پاسخ‌هایی را که از راستی آنها مطمئن نبودیم، کنار گذاشتیم.
        درنهایت به ۲۲۶۹ پاسخ معتبر رسیدیم. تحلیل‌های این گزارش، بر پایهٔ پاسخ‌های معتبر است.
      </Description>
      <BarChart data={percentageDataForBarCharts(data.sexData)} title="پاسخ‌دهندگان؛ نسبت زن و مرد" />
      <Description title="">
        به‌طورکلی پاسخ‌های کمتری از زنان داشتیم که با پخش هدفمند نظرسنجی، این نسبت را کمی تعدیل دادیم؛ اما هنوز با نسبت زن به مرد در جامعه (که تقریباً ۵۰ به ۵۰ است) فاصله دارد.
      </Description>
      <BarChart data={percentageDataForBarCharts(data.birthYearData)} title="پاسخ‌دهندگان؛ سن" />
      <Description title="">
        بیش از نیمی از پاسخ‌دهندگان، دهه‌هفتادی بودند. این نسل درحال‌حاضر و در سال‌های نزدیک پیشِ رو، بازار کار را تشکیل خواهند داد و پاسخ‌های آنها می‌تواند بسیار مؤثر و راهگشا باشد.
      </Description>
      <BarChart data={percentageDataForBarCharts(data.educationStatusData)} title="پاسخ‌دهندگان؛ وضعیت تحصیلی" />
      <BigNumber
        number={67}
        text="از پاسخ‌دهنـدگان، در مقاطع تحصیلات تکمیلی، در رشته‌ای متفاوت به تحصیل خود ادامه داده‌اند."
        textBeforeNumber=""
      />
      <VerticalBarChart
        data={percentageData(data.majorSatisfactionMajorData)}
        title="رضایت از انتخاب رشته به‌تفکیک رشته"
      />
      <Description title="">
        رشته‌هایی که بیشترین میزان رضایت را به خود اختصاص داده‌اند (دبیری و پزشکی)، رشته‌هایی هستند که بازار کار مطمئنی دارند.
      </Description>
      <Description title="اهمیت منابع و مشاورها">
        باتوجه‌به‌اینکه انتخاب رشته معمولاً در سن ۱۸ سالگی باید انجام شود و شاید تجربهٔ زیستهٔ افراد در این سن، به‌اندازهٔ کافی نباشد، ضروری است که در این مرحله از زندگی، به کسب اطلاعات دربارهٔ مسیرهای مختلف پیشِ رو پرداخته شود و این کار، از طریق منابع و مشاورها صورت می‌گیرد.
        منابعی که از آنها استفاده می‌کنیم، درعین‌حال که می‌توانند بسیار مفید واقع شوند و دیدی شفاف از رشته‌های مختلف به ما بدهند، ممکن است تصوری اشتباه از آینده را در ذهنمان پدید آورند و منجر به تصمیمی اشتباه شوند.
        در این بخش از گزارش، به بررسی منابع استفاده‌شده توسط پاسخ‌دهندگان و اثرات هریک از این منابع می‌پردازیم.
      </Description>
      <VerticalBarChart
        data={percentageData(data.majorSatisfactionResourcesData)}
        title="رضایت از انتخاب رشته به‌تفکیک منابع و مشاورهای استفاده‌شده"
      />
      <Description title="">
        مشاهده می‌شود که استفاده از منابعی که ارتباط تنگاتنگی با بازار کار رشته یا محتوای رشته دارند، منجر به کسب رضایت بیشتری از انتخاب رشته می‌شود.
      </Description>
      <Description title="">
        افرادی که از هیچ منبعی استفاده نکرده‌اند، کمترین میزان رضایت از انتخاب رشته را داشته‌اند.
      </Description>
      <Description title="اهمیت بازار کار">
        در بخش اول گزارش مشاهده کردیم که بازار کار، نقشی تعیین‌کننده در تصمیم‌گیری برای رفتن به تحصیلات تکمیلی دارد. همچنین دیدیم که افرادی که رشته‌هایی با بازار کار مطمئن را انتخاب کرده‌اند، میزان رضایت بیشتری از انتخاب رشتهٔ خود دارند.
        در بخش دوم نیز به این نکته رسیدیم که منابعی که با بازار کار رشته‌ها درگیر بوده‌اند، می‌توانند منابع مفیدتری برای انتخاب رشته باشند.
        باتوجه‌به گفته‌های بالا، می‌توان به اهمیت بازار کار در انتخاب رشته پی برد؛ چیزی که در این بخش آن را بیشتر بررسی می‌کنیم.
      </Description>
      <BigNumber
        number={30}
        text="از پاسخ‌دهندگان، در زمان انتخاب رشته، نسبت به بازار کار رشتهٔ خود شناخت داشتند."
        textBeforeNumber="تنها"
      />
      <VerticalBarChart data={percentageData(data.majorSatisfactionMarketInsightData)} title="رضایت از انتخاب رشته به‌تفکیک شناخت از بازار کار" />
      <Description title="">
        شناخت خیلی خوب از بازار کار در زمان انتخاب رشته، منجر شده است ٪۸۸ این افراد از انتخاب رشتهٔ خود رضایت داشته باشند.
      </Description>
      <Description title="">
        درمقابل، شناخت خیلی کم از بازار کار، این عدد را به ۲۴٪ رسانده است.
      </Description>
      <Description title="دربارهٔ حامی گزارش: شتاب‌دهندهٔ استعداد بانا">
        شتاب‌دهندهٔ استعداد بانا یک نظم آموزشی و مشاوره‌ای نوین برای فراگیری مهارت‌های کار تیمی و کمک به اشتغال جوانان است.
        تصمیم‌گیری‌های مهم در مسیر شغلی، آموزش و استخدام از اهداف اصلی شرکت دانش‌بنیان ما،  از آبان سال ۱۳۹۶ تاکنون بوده است.
        ما در بانا همیشه در حال فکرکردن به مفهوم کار و زندگی هستیم...
        و به افراد کمک می‌کنیم تا به یک سؤال مهم جواب بدهند:
        شغل برای شما چه معنایی دارد و برای رسیدن به آن، چه مسیری را انتخاب کرده‌اید یا می‌کنید؟
        یادتان باشد انتخاب مسیر شغلی تصمیمی نیست که فقط یک‌بار در آغاز راه گرفته شود، بلکه فرایندی‌ست تکرارشونده که همواره شما با آن درگیر خواهید بود و نیاز به توجه و مدیریت دارد.
        بااین‌‌حال بسیاری از ما روشی نظام‌مند برای تفکر درمورد موضوع پیچیدهٔ انتخاب یا تغییر شغل در اختیار نداریم و همچنین همهٔ ما تحت‌تأثیر عوامل محیطی و اقتصادی‌ای قرار داریم که فراتر از حیطهٔ کنترل ماست.
        در این شرایط، چگونه می‌توانید در مسیر موفقیت و رضایت باقی بمانید؟
        ما به یک رویکرد ساده و مؤثر می‌اندیشیم. رویکردی که با فضای کاری مدرن و نیازهای شخصی شما هماهنگی داشته باشد.
        ما به شما کمک می‌کنیم تا سیستم کنترل هواپیمای خود را از حالت اتوماتیک خارج کنید، فرمان را در دست بگیرید و به سمتی حرکت کنید که بیشترین میزان رضایت را برای شما به همراه داشته باشد.
        بانا شرایطی را فراهم کرده است که شما بتوانید با کمک مشاورین و آزمون‌های متناسب، علایق، مهارت‌ها، توانمندی‌ها و شخصیت خود را بررسی کنید و به مؤثرترین شکل ممکن آنها را بروز دهید.
        شما می‌توانید با کمک‌گرفتن از مسیرهای رشد و آموزشی که توسط متخصصین در حوزه‌های شغلی مختلف طراحی شده، مسیرهای تازه‌ای را انتخاب و در زمان مناسب طی کنید.
        دانشجویان و فارغ‌التحصیلانی که علاقه‌مند به سرمایه‌گذاری روی توانمندی‌های خود هستند، می‌توانند با ورود به سایت BanaAcc.ir قدم اول را بردارند.
      </Description>
    </div>
  );
};

export default ReportWebVersion;

const Description = ({ title, children }) => {
  return (
    <div className="max-width--article " style={{ width: '100%' }}>
      {title && title !== '' && <h3>{title}</h3>}
      <p className="">{children}</p>
    </div>
  );
};

const BigNumber = ({ number, text, textBeforeNumber = '' }) => {
  return (

    <div className="max-width--article padding border-radius " style={{ background: chartColors.good, color: 'white' }}>
      <p className="with-sidebar a-center gap">
        <span className="font-weight--900 font-size--xxxl" style={{ margin: 0 }}>
          {textBeforeNumber}
          {' '}
          {number}
          ٪
        </span>
        <span style={{ margin: 0 }} className="bold">
          {text}
        </span>
      </p>
    </div>
  );
};
